In [11]:
import pandas as pd
import numpy as np
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [12]:
sns.set_style('white')

In [3]:
column_names = ['user_id', 'item_id', 'rating', 'time_stamp']
df = pd.read_csv('u.data', sep='\t', names = column_names)

In [6]:
df.head()

   user_id  item_id  rating  time_stamp
0        0       50       5   881250949
1        0      172       5   881250949
2        0      133       1   881250949
3      196      242       3   881250949
4      186      302       3   891717742

In [7]:
movie_titles = pd.read_csv('Movie_Id_Titles')

In [8]:
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [9]:
df = pd.merge(df, movie_titles, on = ['item_id'])

In [10]:
df.head()

   user_id  item_id  rating  time_stamp             title
0        0       50       5   881250949  Star Wars (1977)
1      290       50       5   880473582  Star Wars (1977)
2       79       50       4   891271545  Star Wars (1977)
3        2       50       5   888552084  Star Wars (1977)
4        8       50       5   879362124  Star Wars (1977)

In [13]:
df.groupby('title')['rating'].mean().sort_values(ascending = False).head()

title
They Made Me a Criminal (1939)                5.0
Marlene Dietrich: Shadow and Light (1996)     5.0
Saint of Fort Washington, The (1993)          5.0
Someone Else's America (1995)                 5.0
Star Kid (1997)                               5.0
Name: rating, dtype: float64

In [14]:
df.groupby('title')['rating'].count().sort_values(ascending = False).head()

title
Star Wars (1977)             584
Contact (1997)               509
Fargo (1996)                 508
Return of the Jedi (1983)    507
Liar Liar (1997)             485
Name: rating, dtype: int64

In [28]:
ratings = pd.DataFrame(df.groupby('title')['rating'].mean())

In [29]:
ratings["num of ratings"] = pd.DataFrame(df.groupby('title')['rating'].count())

In [30]:
ratings.head()

                             rating  num of ratings
title
'Til There Was You (1997)  2.333333               9
1-900 (1994)               2.600000               5
101 Dalmatians (1996)      2.908257             109
12 Angry Men (1957)        4.344000             125
187 (1997)                 3.024390              41

In [31]:
moviemat = df.pivot_table(index='user_id', columns='title', values='rating')